Public Attributes | List of all members
API_CalcVolumeFormat Struct Reference
Project Settings
The API_CalcUnitPrefs structure contains this structure. More...
#include <APIdefs_Environment.h>
 Public Attributes
API_VolumeTypeID  | unit
The type of the volume measurement unit.
API_ExtraAccuracyID  | accuracy
European methods for rounding decimal values.
short  | decimals
Number of decimals for volume measurement unit [0..4].
Detailed Description
The API_CalcUnitPrefs structure contains this structure.
Member Data Documentation
◆ accuracy
 API_CalcVolumeFormat::accuracy
European methods for rounding decimal values.
◆ decimals
 API_CalcVolumeFormat::decimals
Number of decimals for volume measurement unit [0..4].
◆ unit
 API_CalcVolumeFormat::unit
The type of the volume measurement unit.